In [59]:
import numpy as np

import pandas as pd

In [60]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [61]:
dates = pd.date_range("20330101", periods=6)
dates

DatetimeIndex(['2033-01-01', '2033-01-02', '2033-01-03', '2033-01-04',
               '2033-01-05', '2033-01-06'],
              dtype='datetime64[ns]', freq='D')

In [62]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2033-01-01 -1.862863 -0.221389  0.512760  0.133739
2033-01-02  0.193943  0.711121 -0.579603  2.185777
2033-01-03  1.840420 -0.545098 -0.140771 -0.985472
2033-01-04  1.925228 -1.110519  1.365618  0.709726
2033-01-05 -0.633156  2.420137 -1.283536 -0.047044
2033-01-06  0.197053 -0.417504 -0.929216  0.080010

In [63]:
# dictinory
dict = {'umair': 20, 'ali': 22, 'ahmed': 19}

In [64]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [65]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [66]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[s]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[s](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [67]:
df.head()

                   A         B         C         D
2033-01-01 -1.862863 -0.221389  0.512760  0.133739
2033-01-02  0.193943  0.711121 -0.579603  2.185777
2033-01-03  1.840420 -0.545098 -0.140771 -0.985472
2033-01-04  1.925228 -1.110519  1.365618  0.709726
2033-01-05 -0.633156  2.420137 -1.283536 -0.047044

In [68]:
df.tail(3)

                   A         B         C         D
2033-01-04  1.925228 -1.110519  1.365618  0.709726
2033-01-05 -0.633156  2.420137 -1.283536 -0.047044
2033-01-06  0.197053 -0.417504 -0.929216  0.080010

In [69]:
df.index

DatetimeIndex(['2033-01-01', '2033-01-02', '2033-01-03', '2033-01-04',
               '2033-01-05', '2033-01-06'],
              dtype='datetime64[ns]', freq='D')

In [70]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [71]:
df.to_numpy()

array([[-1.86286288, -0.22138944,  0.51275988,  0.13373852],
       [ 0.19394301,  0.7111211 , -0.57960267,  2.18577661],
       [ 1.84042032, -0.54509824, -0.14077064, -0.98547205],
       [ 1.92522763, -1.11051852,  1.36561799,  0.70972615],
       [-0.6331559 ,  2.4201374 , -1.28353627, -0.04704393],
       [ 0.19705289, -0.41750396, -0.92921568,  0.0800104 ]])

In [72]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [73]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.276771  0.139458 -0.175791  0.346123
std    1.454759  1.264893  0.980722  1.054531
min   -1.862863 -1.110519 -1.283536 -0.985472
25%   -0.426381 -0.513200 -0.841812 -0.015280
50%    0.195498 -0.319447 -0.360187  0.106874
75%    1.429578  0.477993  0.349377  0.565729
max    1.925228  2.420137  1.365618  2.185777

In [74]:
df.T

   2033-01-01  2033-01-02  2033-01-03  2033-01-04  2033-01-05  2033-01-06
A   -1.862863    0.193943    1.840420    1.925228   -0.633156    0.197053
B   -0.221389    0.711121   -0.545098   -1.110519    2.420137   -0.417504
C    0.512760   -0.579603   -0.140771    1.365618   -1.283536   -0.929216
D    0.133739    2.185777   -0.985472    0.709726   -0.047044    0.080010

In [75]:
# jab axis = 1 to column wise sort hoga, jab axis = 0 to row wise sort hoga
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2033-01-01  0.133739  0.512760 -0.221389 -1.862863
2033-01-02  2.185777 -0.579603  0.711121  0.193943
2033-01-03 -0.985472 -0.140771 -0.545098  1.840420
2033-01-04  0.709726  1.365618 -1.110519  1.925228
2033-01-05 -0.047044 -1.283536  2.420137 -0.633156
2033-01-06  0.080010 -0.929216 -0.417504  0.197053

In [76]:
df.sort_values(by="B")

                   A         B         C         D
2033-01-04  1.925228 -1.110519  1.365618  0.709726
2033-01-03  1.840420 -0.545098 -0.140771 -0.985472
2033-01-06  0.197053 -0.417504 -0.929216  0.080010
2033-01-01 -1.862863 -0.221389  0.512760  0.133739
2033-01-02  0.193943  0.711121 -0.579603  2.185777
2033-01-05 -0.633156  2.420137 -1.283536 -0.047044

In [77]:
df["A"]

2033-01-01   -1.862863
2033-01-02    0.193943
2033-01-03    1.840420
2033-01-04    1.925228
2033-01-05   -0.633156
2033-01-06    0.197053
Freq: D, Name: A, dtype: float64

In [78]:
df.A

2033-01-01   -1.862863
2033-01-02    0.193943
2033-01-03    1.840420
2033-01-04    1.925228
2033-01-05   -0.633156
2033-01-06    0.197053
Freq: D, Name: A, dtype: float64

In [79]:
df[["B", "A"]]

                   B         A
2033-01-01 -0.221389 -1.862863
2033-01-02  0.711121  0.193943
2033-01-03 -0.545098  1.840420
2033-01-04 -1.110519  1.925228
2033-01-05  2.420137 -0.633156
2033-01-06 -0.417504  0.197053

In [80]:
df[0:3]

                   A         B         C         D
2033-01-01 -1.862863 -0.221389  0.512760  0.133739
2033-01-02  0.193943  0.711121 -0.579603  2.185777
2033-01-03  1.840420 -0.545098 -0.140771 -0.985472